mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
  // A CRC-bound bootloader setting can cover bytes beyond the first valid
  // EndF (for example padding in a full DFU image). Those bytes are part of the
  // live application even though EndF itself is earlier, so scratch must stay
  // above the complete recorded bank or a power cut would make the old app
  // fail its next boot CRC.
  uint32_t recorded_size = 0u;
#ifdef OTA_DELTA_HOST_TEST
  const int crc_bound = otah_crc_bound_app_size(&recorded_size);
#else
  const bootloader_settings_t *settings;
  bootloader_util_settings_get(&settings);
  const int crc_bound = settings && settings->bank_0 == BANK_VALID_APP_V &&
                        settings->bank_0_crc != 0u;
  recorded_size = crc_bound ? settings->bank_0_size : 0u;
#endif
  const uint32_t endf_size = body_len + ENDF_LEN;
  return !crc_bound || (recorded_size >= endf_size && recorded_size <= limit - APP_BASE);
}
#endif

static int clear_approval(const struct mota_min *o) {
#if defined(MOTA_SD_CARD)
  // This backend has no raw-sector write primitive, so APRV and the checksummed
  // handoff remain on the card. GPREGRET was consumed before any validation or
  // scratch erase, which makes the file inert across a normal reset. A running
  // app may deliberately re-arm it only after authenticating an update command.
  (void)o;
  return 1;
#elif defined(MOTA_QSPI_FLASH)
  if (g_qspi_source) {
    uint8_t z[4] = {0, 0, 0, 0};
    return ota_qspi_write(o->approval_addr, z, sizeof(z)) ? 1 : 0;
  }
  uint8_t z[4] = {0, 0, 0, 0};
  cwrite(o->approval_addr, z, 4);
  cache_flush();
  return 1;
#else
  uint8_t z[4] = {0, 0, 0, 0};
  cwrite(o->approval_addr, z, 4);
  cache_flush();
  return 1;
#endif
}

static bool finish_apply(bool result);

#if defined(MOTA_SD_CARD) || defined(MOTA_QSPI_FLASH) || defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
static int sha256_staged_region(uint32_t offset, uint32_t len, uint8_t out[32]) {
  sha256_ctx_t c;
  sha256_init(&c);
  uint8_t buf[256];
  while (len) {
    inherited_watchdog_feed();
    uint32_t n = len < sizeof(buf) ? len : sizeof(buf);
    if (!staged_read(offset, buf, n)) {
      return 0;
    }
    sha256_update(&c, buf, n);
    offset += n;
    len -= n;
  }
  sha256_final(&c, out);
  return 1;
}
#endif

#if defined(MOTA_BOOTLOADER_UPDATE_ENABLED)
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE) && USB_DESC_UF2_PID == 0x0044
static const uint8_t BOOT_UPDATE_HW_ID[32] = "XIAO_BL_28860044";
#elif defined(MOTA_QSPI_BOOTLOADER_UPDATE)
static const uint8_t BOOT_UPDATE_HW_ID[32] = "XIAO_BL_28860045";
#endif

#define BOOT_UPDATE_BLOCK_COUNT    40u
#define BOOT_UPDATE_PAYLOAD_OFFSET (8u + MOTA_MFL + (BOOT_UPDATE_BLOCK_COUNT * 4u))
#define BOOT_UPDATE_PACKAGE_SIZE   (BOOT_UPDATE_PAYLOAD_OFFSET + MOTA_NRF52_BL_SIZE + sizeof(TRAILER))
#if defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
  #define BOOT_UPDATE_RAW_START MOTA_NRF52_INTERNAL_BL_SLOT_START
#else
  #define BOOT_UPDATE_RAW_START MOTA_NRF52_BL_SCRATCH_START
#endif

typedef char boot_update_raw_start_must_be_page_aligned
  [((BOOT_UPDATE_RAW_START & (MOTA_NRF52_FLASH_PAGE - 1u)) == 0) ? 1 : -1];
typedef char boot_update_raw_image_must_end_before_bootloader
  [((BOOT_UPDATE_RAW_START + MOTA_NRF52_BL_SIZE) <= MOTA_NRF52_BL_START) ? 1 : -1];
typedef char boot_update_device_name_must_fit_manifest
  [(sizeof(DEVICE_NAME) <= BOOTLOADER_UPDATE_DEVICE_NAME_SIZE) ? 1 : -1];

#if defined(MOTA_SD_BOOTLOADER_UPDATE)
typedef char boot_update_sd_token_must_fit_first_scratch_page
  [(MOTA_SD_BOOT_TOKEN_LEN <= MOTA_NRF52_FLASH_PAGE) ? 1 : -1];

static int sd_boot_authorization_valid(const struct mota_min *m) {
  uint8_t token[MOTA_SD_BOOT_TOKEN_LEN];
  fl_read(MOTA_NRF52_BL_SCRATCH_START, token, sizeof(token));
  return m->total == BOOT_UPDATE_PACKAGE_SIZE &&
         mota_sd_boot_token_valid(token, m->total, m->image_hash);
}
#endif

#if defined(MOTA_INTERNAL_BOOTLOADER_UPDATE)
typedef char boot_update_internal_slot_end_must_be_page_aligned
  [((MOTA_NRF52_INTERNAL_BL_SLOT_END & (MOTA_NRF52_FLASH_PAGE - 1u)) == 0) ? 1 : -1];
typedef char boot_update_internal_package_must_bottom_align_at_slot_start
  [(((MOTA_NRF52_INTERNAL_BL_SLOT_END - BOOT_UPDATE_PACKAGE_SIZE) &
     ~(MOTA_NRF52_FLASH_PAGE - 1u)) == MOTA_NRF52_INTERNAL_BL_SLOT_START) ? 1 : -1];
typedef char boot_update_internal_raw_must_fit_shared_slot
  [((MOTA_NRF52_INTERNAL_BL_SLOT_START + MOTA_NRF52_BL_SIZE) <= MOTA_NRF52_INTERNAL_BL_SLOT_END) ? 1 : -1];
typedef char boot_update_internal_compaction_offset_must_fit_one_page
  [(BOOT_UPDATE_PAYLOAD_OFFSET > 0u && BOOT_UPDATE_PAYLOAD_OFFSET < MOTA_NRF52_FLASH_PAGE) ? 1 : -1];
typedef char boot_update_internal_source_must_fit_shared_slot
  [((MOTA_NRF52_INTERNAL_BL_SLOT_START + BOOT_UPDATE_PAYLOAD_OFFSET + MOTA_NRF52_BL_SIZE) <=
    MOTA_NRF52_INTERNAL_BL_SLOT_END) ? 1 : -1];
#endif

#ifndef OTA_DELTA_HOST_TEST
typedef char boot_update_start_must_match_dfu
  [(BOOTLOADER_ADDR_START == MOTA_NRF52_BL_START) ? 1 : -1];
typedef char boot_update_size_must_match_dfu
  [(DFU_BL_IMAGE_MAX_SIZE == MOTA_NRF52_BL_SIZE) ? 1 : -1];
#if defined(MOTA_SD_BOOTLOADER_UPDATE) || defined(MOTA_QSPI_BOOTLOADER_UPDATE)
typedef char boot_update_scratch_must_match_dfu
  [(BOOTLOADER_ADDR_NEW_RECEIVED == MOTA_NRF52_BL_SCRATCH_START) ? 1 : -1];
#endif
#endif

static int boot_update_expected_identity(uint8_t hw_id[32], uint32_t *target_id) {
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  memcpy(hw_id, BOOT_UPDATE_HW_ID, sizeof(BOOT_UPDATE_HW_ID));
  *target_id = BOOT_UPDATE_BOARD_ID;
  return 1;
#else
  static const uint8_t prefix[7] = {'N', 'R', 'F', '_', 'B', 'L', '_'};
  static const char    hex[16]   = "0123456789ABCDEF";
  static const char    name[]    = DEVICE_NAME;
  const uint32_t       name_len  = sizeof(name) - 1u;
  if (BOOT_UPDATE_BOARD_ID == 0 || BOOT_UPDATE_BOARD_ID == UINT32_MAX || name_len == 0 || name_len > 15u) {
    return 0;
  }
  memset(hw_id, 0, 32);
  memcpy(hw_id, prefix, sizeof(prefix));
  for (uint32_t i = 0; i < 8u; i++) {
    hw_id[7u + i] = (uint8_t)hex[(BOOT_UPDATE_BOARD_ID >> (28u - 4u * i)) & 0x0Fu];
  }
  hw_id[15] = '_';
  for (uint32_t i = 0; i < name_len; i++) {
    const uint8_t ch = (uint8_t)name[i];
    if (ch < 0x21u || ch > 0x7Eu) {
      return 0;
    }
    hw_id[16u + i] = ch;
  }
  uint8_t hash[32];
  sha256_ctx_t ctx;
  sha256_init(&ctx);
  sha256_update(&ctx, hw_id, 32);
  sha256_final(&ctx, hash);
  *target_id = rd_u32(hash);
  return *target_id != 0 && *target_id != UINT32_MAX;
#endif
}

static int boot_vectors_valid(const uint8_t vectors[8]) {
  const uint32_t initial_sp = rd_u32(vectors);
  const uint32_t reset      = rd_u32(vectors + 4);
  const uint32_t reset_addr = reset & ~1u;
  return (initial_sp & 7u) == 0 && initial_sp >= 0x20000000u && initial_sp <= 0x20040000u &&
         (reset & 1u) != 0 && reset_addr >= MOTA_NRF52_BL_START &&
         reset_addr < MOTA_NRF52_BL_START + MOTA_NRF52_BL_SIZE;
}

static int staged_vectors_valid(uint32_t payload_addr) {
  uint8_t vectors[8];
  return staged_read(payload_addr, vectors, sizeof(vectors)) && boot_vectors_valid(vectors);
}

static int boot_payload_integrity_valid(const struct mota_min *m) {
  uint8_t image_hash[32];
  // The running application verified the signed manifest, all leaves, and the
  // Merkle root before writing APRV. Recompute the full 256-bit image anchor
  // here; this covers every payload byte without duplicating the Merkle engine
  // in the size-constrained bootloader.
  return sha256_staged_region(m->payload_addr, m->payload_size, image_hash) &&
         memcmp(image_hash, m->image_hash, sizeof(image_hash)) == 0;
}

static int boot_update_policy_valid(const struct mota_min *m) {
  static const uint8_t zeros[8];
  uint8_t              expected_hw_id[32];
  uint32_t             expected_target_id;
  if (!boot_update_expected_identity(expected_hw_id, &expected_target_id)) {
    return 0;
  }
  return m->format_ver == 3 && m->flags == (MFLAG_FULL | MFLAG_SIGNED | MFLAG_BOOTLOADER) &&
         m->hash_algo == 0x12u && m->is_full && m->codec_id == CODEC_FULL &&
         m->target_id == expected_target_id && m->fw_version != 0 &&
         memcmp(m->hw_id, expected_hw_id, sizeof(m->hw_id)) == 0 &&
         memcmp(m->base_hash, zeros, sizeof(zeros)) == 0 && m->block_size_log2 == 10u &&
         m->block_count == BOOT_UPDATE_BLOCK_COUNT &&
         m->image_size == MOTA_NRF52_BL_SIZE && m->payload_size == MOTA_NRF52_BL_SIZE;
}

#ifdef OTA_DELTA_HOST_TEST
extern const uint8_t *otah_flash_pointer(uint32_t address, uint32_t len);
extern int            otah_mbr_copy_bl(uint32_t source, uint32_t word_count);
#endif

static const uint8_t *boot_image_pointer(uint32_t address) {
#ifdef OTA_DELTA_HOST_TEST
  return otah_flash_pointer(address, MOTA_NRF52_BL_SIZE);
#else
  return (const uint8_t *)(uintptr_t)address;
#endif
}

static int boot_image_caps_valid(const uint8_t *image) {
  static const uint8_t magic[8] = {MOTA_BL_MAGIC0, MOTA_BL_MAGIC1, MOTA_BL_MAGIC2, MOTA_BL_MAGIC3,
                                   MOTA_BL_MAGIC4, MOTA_BL_MAGIC5, MOTA_BL_MAGIC6, MOTA_BL_MAGIC7};
  // Scan every aligned match: a magic copy in a literal pool must not hide the
  // real capability marker later in the image. There must be exactly one
  // structurally valid exact-profile marker; duplicate continuity metadata is
  // ambiguous and therefore rejected.
  uint32_t matches = 0;
  for (uint32_t off = 0; off + sizeof(mota_bl_info_t) <= MOTA_NRF52_BL_SIZE; off += 4u) {
    // The internal staged payload begins 365 bytes into its container, so its
    // base is deliberately unaligned even though marker offsets within the
    // raw image are 4-byte aligned. Read every field as bytes: even an enabled
    // Cortex-M UNALIGN_TRP cannot fault this validation path.
    const uint8_t *candidate = image + off;
    int magic_equal = 1;
    for (uint32_t i = 0; i < sizeof(magic); i++) {
      if (candidate[i] != magic[i]) {
        magic_equal = 0;
        break;
      }
    }
    const uint16_t apply_abi  = rd_u16(candidate + offsetof(mota_bl_info_t, apply_abi));
    const uint16_t codec_mask = rd_u16(candidate + offsetof(mota_bl_info_t, codec_mask));
    const uint8_t *storage    = candidate + offsetof(mota_bl_info_t, storage_flags);
    if (magic_equal && apply_abi >= 3u && apply_abi != UINT16_MAX &&
        (codec_mask & MOTA_BOOT_UPDATE_CODEC_MASK) == MOTA_BOOT_UPDATE_CODEC_MASK &&
        storage[0] == MOTA_BOOT_UPDATE_STORAGE_FLAGS &&
        (storage[1] | storage[2] | storage[3]) == 0) {
      if (++matches > 1u) {
        return 0;
      }
    }
  }
  return matches == 1u;
}

